'use strict';
var config = {
    regular: {
        userName: [/^[a-zA-Z0-9\u4e00-\u9fa5]{2,6}$/, '用户名为2-6个中文,数字,字母组合'],
        phone: [/^[0-9]{11}$/, '请输入正确的手机号'],
        pass: [/(.+){6,12}$/, '密码必须6到12位'],
        commentMsg: [/^.{4,140}$/, '140字以内，最少4个字'],
        verifycode: [/^[0-9]{4}$/, '请输入正确验证码'],
        number: [/^([1-9]\d{0,7})$/, '必须输入数字'],
        tuenCouponMsg: [/^.{0,40}$/, '40字以内'],
        userEmail: [/^(|([a-zA-Z0-9_\.\-])+\@(([a-zA-Z0-9\-])+\.)+([a-zA-Z0-9]{2,4})+)$/, '请输入正确邮箱地址'],
        realName: [/^(|[a-zA-Z0-9\u4e00-\u9fa5]{2,6})$/, '姓名为2-6个中文,数字,字母组合']
    }
};